Autodesk.Revit.DB.Analysis.EnergyModelType
This enum is used to define if the energy model is based on rooms/spaces or building elements.
Since:
2016

Autodesk.Revit.DB.Analysis.EnergyModelType.BuildingElement
The building element based energy analytical model.

Autodesk.Revit.DB.Analysis.EnergyModelType.SpatialElement
Energy model based on rooms or spaces.